000_РОЗНИЦА_ЦЕНТР/src/DataProcessors/ОбработчикИнформационныхКарт/ОбработчикИнформационныхКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбработчикИнформационныхКарт</name>
  <attributes>
    <name>ПолноеИмяФайла</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНакопления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецКартыТекущий</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецКартыНовый</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеКарт</name>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КодКарты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДисконтнойКарты</name>
      <type>
        <types>CatalogRef.ВидыДисконтныхКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнформационнаяКарта</name>
      <type>
        <types>CatalogRef.ИнформационныеКарты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВладелецКарты</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНакопления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндексКартинки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПродажиПоДисконтнымКартам</name>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Регистратор</name>
      <type>
        <types>DocumentRef.РеализацияТоваров</types>
        <types>DocumentRef.ВводОстатковПоНакопительнымСкидкам</types>
        <types>DocumentRef.ЧекККМ</types>
        <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
        <types>DocumentRef.СверткаИзУправляющейСистемы</types>
        <types>DocumentRef.ОтчетОРозничныхПродажах</types>
        <types>DocumentRef.КорректировкаРегистров</types>
        <types>DocumentRef.СчетНаОплатуПокупателю</types>
      </type>
    </attributes>
    <attributes>
      <name>ДисконтнаяКарта</name>
      <type>
        <types>CatalogRef.ИнформационныеКарты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВладелецДисконтнойКарты</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

000_РОЗНИЦА_ЦЕНТР/src/AccumulationRegisters/ПродажиПоДисконтнымКартам/ПродажиПоДисконтнымКартам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПродажиПоДисконтнымКартам</name>
  <comment>(Упр)</comment>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДисконтнаяКарта</name>
    <type>
      <types>CatalogRef.ИнформационныеКарты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВладелецДисконтнойКарты</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ВидыИнформационныхКарт/ВидыИнформационныхКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыИнформационныхКарт</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Штриховая</name>
  </enumValues>
  <enumValues>
    <name>Магнитная</name>
  </enumValues>
  <enumValues>
    <name>Смешанная</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ТипыИнформационныхКарт/ТипыИнформационныхКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыИнформационныхКарт</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Дисконтная</name>
  </enumValues>
  <enumValues>
    <name>Регистрационная</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ИнформационныеКарты/ИнформационныеКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеКарты</name>
  <comment>(Упр) Магнитные и штриховые карты.</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Блокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДисконтнойКарты</name>
    <type>
      <types>CatalogRef.ВидыДисконтныхКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКарты</name>
    <type>
      <types>EnumRef.ВидыИнформационныхКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецКарты</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоОпроса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСледующегоОпроса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КодКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <comment>Магазин, где была проведена выдача карты</comment>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Резерв</name>
    <comment>(Служ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКарты</name>
    <type>
      <types>EnumRef.ТипыИнформационныхКарт</types>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/DataProcessors/ОбработчикИнформационныхКарт/ObjectModule.bsl
Процедура ЗаполнитьТабличнуюЧастьДаннымиФайла(АдресВХранилище, Расширение)	Экспорт

	ТабличныйДокумент  = Новый ТабличныйДокумент;
	МассивДанных       = Новый Массив;
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХранилище);
	ДвоичныеДанные.Записать(ИмяВременногоФайла);

	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("НомерСтроки"    , Новый ОписаниеТипов("Число"));
	ТаблицаЗначений.Колонки.Добавить("КодКарты"       , Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(200)));
	ТаблицаЗначений.Колонки.Добавить("СуммаНакопления", Новый ОписаниеТипов("Число"));

	СоставСтроки = Новый Массив;
	СоставСтроки.Добавить(Новый Структура("Колонка, Имя, Текст", 1, "КодКарты", Истина));
	СоставСтроки.Добавить(Новый Структура("Колонка, Имя, Текст", 2, "СуммаНакопления", Ложь));
	ТипЧисло = Новый ОписаниеТипов("Число");

	Попытка

		ТабличныйДокумент.Прочитать(ИмяВременногоФайла, СпособЧтенияЗначенийТабличногоДокумента.Значение);

		ПерваяСтрока    = 1;
		КоличествоСтрок = ТабличныйДокумент.ВысотаТаблицы;

	 	Для НомерСтроки = ПерваяСтрока По КоличествоСтрок Цикл

			Для каждого Позиция Из СоставСтроки Цикл

				ТекущаяОбласть = ТабличныйДокумент.ПолучитьОбласть(
					"R" + Формат(НомерСтроки, "ЧДЦ=; ЧН=0; ЧГ=") +
					"C" + Формат(Позиция.Колонка, "ЧДЦ=; ЧН=0; ЧГ=")).ТекущаяОбласть;

				Попытка

					ЗначениеЯчейки = ТекущаяОбласть.Значение;

				Исключение
					
					Если Позиция.Имя = "КодКарты" Тогда

							ЗначениеЯчейки = ТекущаяОбласть.Текст;

					Иначе	ЗначениеЯчейки = ТипЧисло.ПривестиЗначение(СтрЗаменить(ТекущаяОбласть.Текст, ",", "."));

					КонецЕсли;

				КонецПопытки;

				Если ТипЗнч(ЗначениеЯчейки) = Тип("Число") И Позиция.Имя = "КодКарты" Тогда

					ЗначениеЯчейки = Формат(ЗначениеЯчейки, "ЧДЦ=; ЧГ=");

				КонецЕсли;

				Если Позиция.Имя = "КодКарты" Тогда

					Если НЕ ПустаяСтрока(ЗначениеЯчейки) И СтрДлина(ЗначениеЯчейки) > 5 Тогда

						СтрокаТаблицы = ТаблицаЗначений.Добавить();
						СтрокаТаблицы.НомерСтроки = НомерСтроки;

					Иначе

						Прервать;

					КонецЕсли;

				КонецЕсли;

				СтрокаТаблицы[Позиция.Имя] = ЗначениеЯчейки;
					
				Если Позиция.Текст Тогда

					СтрокаТаблицы[Позиция.Имя] = СокрЛП(СтрокаТаблицы[Позиция.Имя]);

				КонецЕсли;

				Если Позиция.Имя = "СуммаНакопления" И СтрокаТаблицы[Позиция.Имя] = 0 Тогда

					СтрокаТаблицы[Позиция.Имя] = СуммаНакопления;

				КонецЕсли;

			КонецЦикла;

		КонецЦикла;

	//	\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\/

		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Таблица.НомерСтроки КАК НомерСтроки,
		|	Таблица.КодКарты КАК КодКарты,
		|	Таблица.СуммаНакопления КАК СуммаНакопления
		|ПОМЕСТИТЬ Источник
		|ИЗ
		|	&ТаблицаЗначений КАК Таблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Ведущая.НомерСтроки КАК НомерСтроки,
		|	ИСТИНА КАК Пометка,
		|	Ведущая.КодКарты КАК КодКарты,
		|	Ведущая.СуммаНакопления КАК СуммаНакопления,
		|	ИнформационныеКарты.Ссылка КАК ИнформационнаяКарта,
		|	ИнформационныеКарты.ВладелецКарты КАК ВладелецКарты,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ИнформационныеКарты.ВидДисконтнойКарты, ЗНАЧЕНИЕ(Справочник.ВидыДисконтныхКарт.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ВидыДисконтныхКарт.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДисконтныхКарт.ПредварительныеКартыЛояльности)
		|		ИНАЧЕ ИнформационныеКарты.ВидДисконтнойКарты
		|	КОНЕЦ КАК ВидДисконтнойКарты,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ИнформационныеКарты.ВидДисконтнойКарты, ЗНАЧЕНИЕ(Справочник.ВидыДисконтныхКарт.ПредварительныеКартыЛояльности)) = ЗНАЧЕНИЕ(Справочник.ВидыДисконтныхКарт.ПредварительныеКартыЛояльности)
		|			ТОГДА 2
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ИндексКартинки
		|ИЗ
		|	Источник КАК Ведущая
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИнформационныеКарты КАК ИнформационныеКарты
		|		ПО Ведущая.КодКарты = ИнформационныеКарты.КодКарты
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки"
		);
		Запрос.УстановитьПараметр("ТаблицаЗначений", ТаблицаЗначений);

		ДанныеКарт.Загрузить(Запрос.Выполнить().Выгрузить());

	Исключение

		ТекстОшибки = ОписаниеОшибки();
		Сообщить(ТекстОшибки);

	КонецПопытки;

КонецПроцедуры

Процедура СоздатьИнформационныеКарты(ТаблицаОстатки)	Экспорт

	Для каждого СтрокаТабличнойЧасти Из ДанныеКарт Цикл

		Если НЕ СтрокаТабличнойЧасти.Пометка Тогда

			Продолжить;

		КонецЕсли;

	//	---------------------------------------------------------------------------------------

		Если СтрокаТабличнойЧасти.ИнформационнаяКарта.Пустая() Тогда

			Если НЕ Справочники.ИнформационныеКарты.НайтиПоРеквизиту("КодКарты", СокрЛП(СтрокаТабличнойЧасти.КодКарты)).Пустая() Тогда

			//	LNK 14.08.2020 07:14:45
				ВызватьИсключение "Прервано! Код карты [" + СокрЛП(СтрокаТабличнойЧасти.КодКарты) + "] обнаружен в справочнике.";

			КонецЕсли;

			КартаОбъект = Справочники.ИнформационныеКарты.СоздатьЭлемент();
			КартаОбъект.УстановитьСсылкуНового(Справочники.ИнформационныеКарты.ПолучитьСсылку());
			КартаОбъект.КодКарты      = СокрЛП(СтрокаТабличнойЧасти.КодКарты);
			КартаОбъект.Наименование  = КартаОбъект.КодКарты;

			КартаОбъект.УстановитьНовыйКод();

			КартаОбъект.ВладелецКарты      = Неопределено;
			КартаОбъект.ВидКарты           = Перечисления.ВидыИнформационныхКарт.Магнитная;
			КартаОбъект.ВидДисконтнойКарты = Справочники.ВидыДисконтныхКарт.ПредварительныеКартыЛояльности;
			КартаОбъект.ТипКарты           = Перечисления.ТипыИнформационныхКарт.Дисконтная;
			КартаОбъект.ДатаОткрытия       = Неопределено;
			КартаОбъект.ДатаСоздания       = ТекущаяДатаСеанса();
			КартаОбъект.Блокирован         = Ложь;

			СтрокаТабличнойЧасти.ИнформационнаяКарта = КартаОбъект.ПолучитьСсылкуНового();

		Иначе

			КартаОбъект = Неопределено;

		КонецЕсли;

		Если НЕ КартаОбъект = Неопределено Тогда

			Если НЕ КартаОбъект = Неопределено Тогда

				КартаОбъект.ОбменДанными.Загрузка = Истина;
				КартаОбъект.Записать();

			КонецЕсли;

		КонецЕсли;

	//	---------------------------------------------------------------------------------------

		Если НЕ СтрокаТабличнойЧасти.СуммаНакопления = 0 Тогда

			СтрокаДокумента = ТаблицаОстатки.Добавить();

			СтрокаДокумента.ДисконтнаяКарта = СтрокаТабличнойЧасти.ИнформационнаяКарта;
			СтрокаДокумента.Сумма			= СтрокаТабличнойЧасти.СуммаНакопления;
			СтрокаДокумента.Количество		= 1 * ?(СтрокаТабличнойЧасти.СуммаНакопления < 0, -1, 1);

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

//	\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\/

Процедура ЗаполнитьТаблицуПродажиПоДисконтнымКартам()	Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ИСТИНА КАК Пометка,
	|	ТаблицаРегистра.Период КАК Период,
	|	ТаблицаРегистра.Регистратор КАК Регистратор,
	|	ТаблицаРегистра.НомерСтроки КАК НомерСтроки,
	|	ТаблицаРегистра.ДисконтнаяКарта,
	|	ТаблицаРегистра.ВладелецДисконтнойКарты,
	|	ТаблицаРегистра.Номенклатура,
	|	ТаблицаРегистра.Сумма,
	|	ТаблицаРегистра.Количество
	|ИЗ
	|	РегистрНакопления.ПродажиПоДисконтнымКартам КАК ТаблицаРегистра
	|ГДЕ
	|	ТаблицаРегистра.ВладелецДисконтнойКарты = &ВладелецДисконтнойКарты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	Регистратор,
	|	НомерСтроки"
	);
	Запрос.УстановитьПараметр("ВладелецДисконтнойКарты", ВладелецКартыТекущий);

	ПродажиПоДисконтнымКартам.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

Процедура ВыполнитьЗаменуВладельцаВРегистреПродажиПоДисконтнымКартам()	Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТабличнаяЧасть.Пометка,
	|	ТабличнаяЧасть.Период,
	|	ТабличнаяЧасть.Регистратор,
	|	ТабличнаяЧасть.НомерСтроки,
	|	ТабличнаяЧасть.ДисконтнаяКарта,
	|	ТабличнаяЧасть.ВладелецДисконтнойКарты,
	|	ТабличнаяЧасть.Номенклатура
	|ПОМЕСТИТЬ Таблица
	|ИЗ
	|	&ТабличнаяЧасть КАК ТабличнаяЧасть
	|ГДЕ
	|	ТабличнаяЧасть.Пометка = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.Период КАК Период,
	|	Таблица.Регистратор КАК Регистратор,
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.ДисконтнаяКарта,
	|	Таблица.ВладелецДисконтнойКарты,
	|	Таблица.Номенклатура
	|ИЗ
	|	Таблица КАК Таблица
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	Регистратор,
	|	НомерСтроки
	|ИТОГИ ПО
	|	Регистратор"
	);
	Запрос.УстановитьПараметр("ТабличнаяЧасть", ПродажиПоДисконтнымКартам);
	
	ВедущаяВыборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВедущаяВыборка.Следующий() Цикл

		НаборЗаписей = РегистрыНакопления.ПродажиПоДисконтнымКартам.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ВедущаяВыборка.Регистратор);
		НаборЗаписей.Прочитать();

		ЕстьИзменение = Ложь;
		ТаблицаНабора = НаборЗаписей.Выгрузить();

		ДеталиВыборка = ВедущаяВыборка.Выбрать();

		Пока ДеталиВыборка.Следующий() Цикл

			СтрокиОтобранные = ТаблицаНабора.НайтиСтроки(Новый Структура(
				"ВладелецДисконтнойКарты, Номенклатура"
				, ВладелецКартыТекущий, ДеталиВыборка.Номенклатура));

			Для каждого СтрокаТаблицы Из СтрокиОтобранные Цикл

				СтрокаТаблицы.ВладелецДисконтнойКарты = ВладелецКартыНовый;
				ЕстьИзменение = Истина;

			КонецЦикла;

		КонецЦикла;

		Если ЕстьИзменение Тогда

			НаборЗаписей.Загрузить(ТаблицаНабора);

			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения", Истина);
			НаборЗаписей.Записать();

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры
